## brew tree
# broot
# └── libxcb
#     ├── libxau
#     │   └── xorgproto
#     └── libxdmcp
#         └── xorgproto
# git-delta
# lazygit
# mas
# nano
# ├── gettext
# └── ncurses
# nanorc
# nushell
# └── openssl@3
#     └── ca-certificates
# rtx
# starship
# isacikgoz/taps/tldr
##
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "isacikgoz/taps"
# New way to see and navigate directory trees
brew "broot"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Improved Nano Syntax Highlighting Files
brew "nanorc"
# Modern shell for the GitHub era
brew "nushell"
# Polyglot runtime manager (asdf rust clone)
brew "rtx"
# Cross-shell prompt for astronauts
brew "starship"
# fast and interactive tldr client written with go
brew "isacikgoz/taps/tldr"
# Chromium based browser
cask "arc"
# Menu bar icon organizer
cask "bartender"
# Missing menulet for Homebrew
cask "brewlet"
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# Screen capturing tool
cask "cleanshot"
# Audio and video editor
cask "descript"
# Version of Cascadia Code with embedded Powerline symbols
cask "font-cascadia-code-pl"
# Nerd Font font with round corners
cask "font-maple"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Open-source video transcoder
cask "handbrake"
# Convert your caps lock key or any of your modifier keys to the hyper key
cask "hyperkey"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Noise cancelling application
cask "krisp"
# Utility that shows the latest app updates
cask "latest"
# Menubar app for easy ChatGPT access with conversation and inline modes
cask "macgpt"
# Multi-platform web browser
cask "microsoft-edge-dev"
# All system and utility switches in one place
cask "one-switch"
# Screen measuring tool
cask "pixelsnap"
# Control your tools with a few keystrokes
cask "raycast"
# Detects which app receives a keyboard shortcut (hotkey)
cask "shortcutdetective"
# Screenshot measurement and annotation tool
cask "shottr"
# Tool to simulate responsive designs on multiple devices
cask "sizzy"
# Email client with collaborative notes
cask "twobird"
# Turn websites into apps
cask "unite"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
mas "ColorSlurp", id: 1287239339
mas "Craft", id: 1487937127
mas "Internet Status", id: 1039633009
mas "iPreview", id: 1519213509
mas "iStatistica Pro", id: 1447778660
mas "Passepartout", id: 1433648537
mas "stts", id: 1187772509
mas "Velja", id: 1607635845
mas "Whisper", id: 1668083311
vscode "aaron-bond.better-comments"
vscode "antfu.file-nesting"
vscode "antfu.smart-clicks"
vscode "antfu.unocss"
vscode "antfu.vite"
vscode "anweber.httpbook"
vscode "anweber.vscode-httpyac"
vscode "Babobski.jsregextester"
vscode "ban.spellright"
vscode "bengreenier.vscode-node-readme"
vscode "bierner.comment-tagged-templates"
vscode "bierner.docs-view"
vscode "bierner.gif-player"
vscode "bierner.jsdoc-markdown-highlighting"
vscode "bloodycrown.simple-extension-manager"
vscode "bloodycrown.tex_recs_🦖_code_intelligence"
vscode "bloodycrown.tex_recs_🦖_content_management"
vscode "bloodycrown.tex_recs_🦖_editor_ui"
vscode "bloodycrown.tex_recs_🦖_essentials"
vscode "bloodycrown.tex_recs_🦖_extras"
vscode "bloodycrown.tex_recs_🦖_front_end_tooling"
vscode "bloodycrown.tex_recs_🦖_github"
vscode "bloodycrown.tex_recs_🦖_input_modes"
vscode "bloodycrown.tex_recs_🦖_js_code_intelligence"
vscode "bloodycrown.tex_recs_🦖_js_package_management"
vscode "bloodycrown.tex_recs_🦖_js_ts_debugging"
vscode "bloodycrown.tex_recs_🦖_missing_languages"
vscode "bloodycrown.tex_recs_🦖_notebooks"
vscode "bloodycrown.tex_recs_🦖_personal_picks"
vscode "bloodycrown.tex_recs_🦖_vue"
vscode "bradlc.vscode-tailwindcss"
vscode "carlocardella.vscode-texttoolbox"
vscode "chdsbd.githubinator"
vscode "chenglou92.rescript-vscode"
vscode "cmoog.sqlnotebook"
vscode "codespaces-contrib.codeswing"
vscode "CS50.vscode-presentation-mode"
vscode "deque-systems.vscode-axe-linter"
vscode "donjayamanne.typescript-notebook"
vscode "donjayamanne.vscode-jupytext"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "eliostruyf.screendown"
vscode "eliostruyf.vscode-front-matter"
vscode "foam.foam-vscode"
vscode "garrit.p5js-notebook"
vscode "garrit.stylebook"
vscode "GitHub.codespaces"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "henriqueBruno.github-repository-manager"
vscode "heybourn.headwind"
vscode "IBM.output-colorizer"
vscode "idered.npm"
vscode "ipatalas.vscode-postfix-ts"
vscode "jacobcofman.changelog"
vscode "Jeusto.warm-up-typing-test"
vscode "lostintangent.thinking-in-code"
vscode "lostintangent.wikilens"
vscode "max-SS.Cyberpunk"
vscode "mechatroner.rainbow-csv"
vscode "meganrogge.template-string-converter"
vscode "moalamri.inline-fold"
vscode "ModoNoob.vscode-hipster-theme"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-playwright.playwright"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-markdown-notebook"
vscode "ms-vsliveshare.vsliveshare"
vscode "nortakales.vs-qalc"
vscode "Nuxt.mdc"
vscode "Nuxtr.nuxtr-vscode"
vscode "ocamllabs.ocaml-platform"
vscode "oderwat.indent-rainbow"
vscode "OnlyLys.leaper"
vscode "Orta.vscode-twoslash-queries"
vscode "pedro-w.tmlanguage"
vscode "pflannery.vscode-versionlens"
vscode "PKief.material-icon-theme"
vscode "pomber.git-file-history"
vscode "RandomFractalsInc.vscode-data-preview"
vscode "redhat.fabric8-analytics"
vscode "redhat.vscode-yaml"
vscode "RLNT.keep-a-changelog"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "Shopify.theme-check-vscode"
vscode "snipsnapdev.snipsnap-vscode"
vscode "sooniter.pnpm-lock-goto"
vscode "sourcegraph.cody-ai"
vscode "sourcegraph.sourcegraph"
vscode "tamasfe.even-better-toml"
vscode "TheNuProjectContributors.vscode-nushell-lang"
vscode "tinaciousdesign.theme-tinaciousdesign"
vscode "tlent.jest-snapshot-language-support"
vscode "trunk.io"
vscode "uniquevision.vscode-plpgsql-lsp"
vscode "usernamehw.errorlens"
vscode "usernamehw.find-jump"
vscode "vsls-contrib.codetour"
vscode "vsls-contrib.gistfs"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "vunguyentuan.vscode-postcss"
vscode "WallabyJs.console-ninja"
vscode "WallabyJs.quokka-vscode"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zenclabs.previewjs"
vscode "zernonia.supabase-vscode"
vscode "ZixuanChen.vitest-explorer"
