tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "bat"
brew "cowsay"
brew "diff-so-fancy"
brew "fastmod"
brew "fd"
brew "fortune"
brew "fzf"
brew "jq"
brew "lsd"
brew "mas"
brew "mdcat"
brew "nano"
brew "ripgrep"
brew "tldr"
brew "yarn"
cask "bartender"
cask "flotato"
cask "font-ibmplexmono-nerd-font"
cask "forklift"
cask "gitkraken"
cask "gitup"
cask "google-backup-and-sync"
cask "google-chrome"
cask "insomnia"
cask "krisp"
cask "switchresx"
cask "visual-studio-code-insiders"
cask "vyprvpn"
cask "zoomus"
mas "Dato", id: 1470584107
mas "Divvy", id: 413857545
mas "Kiwi for Gmail", id: 986304488
mas "LastPass", id: 926036361
mas "Lungo", id: 1263070803
mas "Xcode", id: 497799835
